Dlubal.RFEM5.ILine
Interface for working with line.

Dlubal.RFEM5.ILine.GetData
Gets line parameters.
Returns: Line parameters.

Dlubal.RFEM5.ILine.SetData(System.UInt32@)
Sets line parameters.
Line: Line parameters.

Dlubal.RFEM5.ILine.Delete
Deletes line.

Dlubal.RFEM5.ILine.GetLocalCoordinateSystem(System.Double)
Gets line local coordinate system.
Returns: Local coordinate system interface
Param: Parameter in interval

Dlubal.RFEM5.ILine.GetPointOnLine(System.Double)
Gets 3D point on the line in global coordinate system.
Returns: 3D point on the line.
Param: Parameter in interval .